Repository: hieuttblackpink/vts-kit-flutter-core
Catalog: lib/l10n/core_*.arb
Languages: vi

# loginTxtUsername
source: User name
vi: Tên đăng nhập

# loginTxtPassword
source: Password
vi: Mật khẩu

# loginBtnLogin
source: Login
vi: Đăng nhập

source: Log in with Fingerprint
vi: Đăng nhập bằng vân tay

# loginWithFaceId
source: Log in Face ID
vi: Đăng nhập bằng Face ID

# bioSecurityNotEnabled
source: Biometric security not enabled, please turn it on
vi: Bảo mật sinh trắc học chưa được thiết lập, vui lòng bật

# loginAltEmptyUserNamePassword
source: Username and password cannot be null
vi: Tên đăng nhập và mật khẩu không được bỏ trống

# loginAlrLoading
source: Authenticating
vi: Đang xác thực

# loadAccessControl
source: Loading access control policy
vi: Đang xác thực quyền

# socketException
source: No internet, please try again
vi: Không có mạng vui lòng thử lại

# timeoutException
source: Time out to process the request
vi: Quá thời gian xử lý yêu cầu

# authorizationException
source: Authorization error, please login again
vi: Lỗi xác thực vui lòng đăng nhập lại

# notFoundException
source: Content not found, please come back later
vi: Không tìm thấy nội dung, vui lòng quay lại sau

# unsupportedLanguageException
source: Language {argument} is not supported
vi: Ngôn ngữ {argument} không được hỗ trợ

# commonException
source: Error! An error occurred, please try again later
vi: Đã xảy ra lỗi

# noSuchMethodException
source: An error occurred while retrieving data
vi: Đã xảy ra lỗi trong quá trình lấy dữ liệu

# notFoundPageInStreamChannel
source: Not found page in stream
vi: Không tìm thấy trang trong kênh chuyển màn hình

# emptyStreamChannel
source: Stream channel can not empty
vi: Kênh chuyển màn hình không được bỏ trống

# cancelRequestException
source: Task is canceled
vi: Thao tác đã dừng lại

# biometricAuthLocalizedReason
source: Let OS determine authentication method
vi: Để hệ điều hành quyết định cách xác thực

# biometricHint
source: Verify identity
vi: Xác nhận danh tính

# biometricNotRecognized
source: Not recognized. Try again.
vi: Không nhận ra. Vui lòng thử lại

# biometricRequiredTitle
source: Biometric required
vi: Yêu cầu sinh trắc học

# biometricSuccess
source: Success
vi: Thành công

# biometricCancelButton
source: Cancel
vi: Hủy

# biometricDeviceCredentialsRequiredTitle
source: Device credentials required
vi: Yêu cầu thông tin thiết bị

# biometricDeviceCredentialsSetupDescription
source: Device credentials required
vi: Yêu cầu thông tin thiết bị

# biometricGoToSettingsButton
source: Go to settings
vi: Vào cài đặt

# biometricGoToSettingsDescription
source: Biometric authentication is not set up on your device. Go to 'Settings > Security' to add biometric authentication.
vi: Xác thực sinh trắc học không được cài đặt ở thiết bị của bạn. Vào 'Cài đặt > Bảo mật' để thêm xác thực sinh trắc học

# biometricIOSGoToSettingsDescription
source: Biometric authentication is not set up on your device. Please either enable Touch ID or Face ID on your phone.
vi: Xác thực sinh trắc học không được cài đặt ở thiết bị của bạn. Vui lòng bật Touch ID hoặc Face ID trên điện thoại của bạn

# biometricSignInTitle
source: Authentication required
vi: Yêu cầu xác thực

# biometricLockOut
source: Biometric authentication is disabled. Please lock and unlock your screen to enable it.
vi: Xác thực sinh trắc học đang bị vô hiệu hóa. Vui lòng khóa và mở khóa màn hình của bạn để bật nó
